       IDENTIFICATION DIVISION.
       PROGRAM-ID. CREA1.
       AUTHOR. CLAUDIO-RUZ.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       
           SELECT FACTURA-COMPRA ASSIGN TO DISK
           ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC
           RECORD KEY IS C-NUMERO-FACTURA.

           SELECT LABORATORIO ASSIGN TO DISK
           ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC
           RECORD KEY IS RUT-LABORATORIO.

           SELECT MEDICAMENTOS ASSIGN TO DISK
           ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC
           RECORD KEY IS CODIGO-MEDICAMENTO.
       DATA DIVISION.
       FILE SECTION.
       FD FACTURA-COMPRA
           LABEL RECORD IS STANDARD
           VALUE OF FILE-ID "COMPRAS.DAT".
       01 REG-FACTURA.
          02 C-CODIGO-FACTURA     PIC X(6).
          02 C-NUMERO-FACTURA     PIC X(6).
          02 C-RUT-LABORATORIO    PIC X(8).
       
       FD LABORATORIO
           LABEL RECORD IS STANDARD
           VALUE OF FILE-ID "LAB.DAT".
       01 REG-LABORATORIO.
          02 RUT-LABORATORIO      PIC X(8).
          02 RAZON-SOCIAL         PIC X(15).
          02 DIR-LABORATORIO      PIC X(30).
          02 FONO-LABORATORIO     PIC X(10).
       
       FD MEDICAMENTOS
           LABEL RECORD IS STANDARD
           VALUE OF FILE-ID "MEDICAMENTOS.DAT".
       01 REG-MEDICAMENTOS.
          02 CODIGO-MEDICAMENTO  PIC X(6).
          02 DESCR-MEDICAMENTO   PIC X(30).
          02 CANTIDAD-STOCK      PIC 9(5).
          02 PRECIO-COSTO-U      PIC 9(7).
          02 MED-RUT-LABORATORIO PIC X(8).
          02 UNIDAD-MEDIDA       PIC X(2).
          02 CANT-STOCK-CRITICO  PIC 9(5).
          02 FECHA-ELAVORACION.
             03 DIA-ELAVORACION  PIC 99.
             03 MES-ELAVORACION  PIC 99.
             03 ANO-ELAVORACION  PIC 99.
          02 FECHA-VENCIMIENTO.
             03 DIA-VENCIMIENTO  PIC 99.
             03 MES-VENCIMIENTO  PIC 99.
             03 ANO-VENCIMIENTO  PIC 99.
          02 FECHA-COMPRA.
             03 DIA-COMPRA       PIC 99.
             03 MES-COMPRA       PIC 99.
             03 ANO-COMPRA       PIC 99.
	     PROCEDURE DIVISION.
	      INICIO.
	      ABRIR-FICHEROS.
           OPEN OUTPUT FACTURA-COMPRA.
           OPEN OUTPUT LABORATORIO.
           OPEN OUTPUT MEDICAMENTOS.
           CLOSE FACTURA-COMPRA.
           CLOSE LABORATORIO.
           CLOSE MEDICAMENTOS.
           STOP RUN.
